hotelws/test_data/hotel_res_req.xml

<soap-env:Envelope xmlns:soap-env="http://schemas.xmlsoap.org/soap/envelope/" 
    xmlns:eb="http://www.ebxml.org/namespaces/messageHeader" 
    xmlns:xlink="http://www.w3.org/2001/xlink" 
    xmlns:xsd="http://www.w3.org/2001/XMLSchema">
    <soap-env:Header>
        <eb:MessageHeader soap-env:mustUnderstand="1" eb:version="2.0.0">
            <eb:From>
                <eb:PartyId type="urn:x12.org:IO5:01">www.rentsomewheels.com</eb:PartyId>
            </eb:From>
            <eb:To>
                <eb:PartyId type="urn:x12.org:IO5:01">webservices.sabre.com</eb:PartyId>
            </eb:To>
            <eb:CPAId>DG7F</eb:CPAId>
            <eb:ConversationId>fds8789h|dev@z.com</eb:ConversationId>
            <eb:Service eb:type="sabreXML">OTA_HotelResRQ</eb:Service>
            <eb:Action>OTA_HotelResRQ</eb:Action>
            <eb:MessageData>
                <eb:MessageId>mid:20180216-07:18:42.3|14oUa</eb:MessageId>
                <eb:Timestamp>2018-06-06T19:14:34Z</eb:Timestamp>
            </eb:MessageData>
        </eb:MessageHeader>
        <wsse:Security xmlns:wsse="http://schemas.xmlsoap.org/ws/2002/12/secext" 
            xmlns:wsu="http://schemas.xmlsoap.org/ws/2002/12/utility">
            <wsse:BinarySecurityToken>Shared/IDL:IceSess\/SessMgr:1\.0.IDL/Common/!ICESMS\/RESH!ICESMSLB\/RES.LB!-3138669598916150388!718951!0</wsse:BinarySecurityToken>
        </wsse:Security>
    </soap-env:Header>
    <soap-env:Body>
        <OTA_HotelResRQ xmlns="http://webservices.sabre.com/sabreXML/2011/10" 
            xmlns:xs="http://www.w3.org/2001/XMLSchema" 
            xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" Version="2.2.0">
            <Hotel>
                <BasicPropertyInfo RPH="1"></BasicPropertyInfo>
                <Guarantee Type="G">
                    <CC_Info>
                        <PaymentCard Code="MC" ExpireDate="2019-12" Number="5105105105105100"></PaymentCard>
                        <PersonName NameNumber="1.1" NameReference="ABC123" PassengerType="ADT">
                            <GivenName>Test</GivenName>
                            <Surname>Booking</Surname>
                        </PersonName>
                    </CC_Info>
                </Guarantee>
            </Hotel>
        </OTA_HotelResRQ>
    </soap-env:Body>
</soap-env:Envelope>